Revit 2027 API
RebarHookType.GetHookExtensionLength Method
 Computes the hook extension length based on current hook length
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetHookExtensionLength(
	RebarBarType barType
)
Public Function GetHookExtensionLength (
	barType As RebarBarType
) As Double
public:
double GetHookExtensionLength(
	RebarBarType^ barType
)
member GetHookExtensionLength :
        barType : RebarBarType -> float
Parameters
barType RebarBarType
Return Value
Double
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace